/*Задача 17.
Каса. 
Користувачу повідомляють суму, яку йому треба сплатити.
Користувач поступово вводить суму грошей до тих пір, поки суми не буде достатньо для оплати товарів
 (кожного разу користувачу повідомляють, яку ще суму потрібно ввести).
*/

const totalPrice = 12000;
let money = 0;
do {
  let userMoney = parseInt(
    prompt(`Будь ласка, заплатіть за товар. Вам потрібно сплатити ${totalPrice - money}`)
  );
  money += userMoney;
} while (money < totalPrice);
alert("Дякуємо, ви внесли необхідну суму");
