/*Задача 3. 
Випадковим чином генерується число від 1 до 5. 
Спробуйте вгадати число за 2 спроби.
*/

// генеруємо випадкове число від 1 до 5
const randomNum = Math.floor(Math.random() * 5) + 1;
console.log(randomNum);

// Спрощений варіант
/*===========================
// отримуєм число для першої спроби
let userNum = parseInt(
  prompt("У вас 2 спроби. Введіть число від 1 до 5:")
);

// алгоритм перевірки
if (userNum === randomNum) {
  alert(
    `Вітаємо! Ви вгадали число з першої спроби! Правильне число: ${randomNum}`
  );
} else {
  alert("Неправильно! Спробуйте ще раз."); 
  // отримуєм число у другій спробі
  userNum = parseInt(
    prompt("У вас залишилась 1 спроба. Введіть число від 1 до 5:")
  );
  if (userNum === randomNum) {
    alert(
      `Вітаємо! Ви вгадали число з другої спроби! Правильне число: ${randomNum}`
    );
  } else {
    alert(`Ви використали всі спроби. Правильне число: ${randomNum}`);
  }
}
==============================*/

// Модернізований варіант
let stepCount = parseInt(
  prompt("Вкажіть кількість спроб для відгадування числа:", "2")
);

// алгоритм перевірки
while (stepCount > 0) {
  let userNum = parseInt(
    prompt(`У вас ${stepCount} спроби. Введіть число від 1 до 5:`)
  );

  if (userNum === randomNum) {
    alert(`Вітаємо! Ви вгадали число! Правильне число: ${randomNum}`);
    break;
  } else {
    stepCount--;
    if (stepCount > 0) {
      alert("Неправильно! Спробуйте ще раз.");
    } else {
      alert(`Ви використали всі спроби. Правильне число: ${randomNum}`);
    }
  }
}
